{
  "name" : "Stanford Dependencies",
  "typeUiName" : null,
  "description" : "Stanford Dependencies for English\r\n\r\nThe English version of the Stanford dependencies has been developed by Marie-Catherine de Marneffe, Bill MacCartney, and Christopher Manning. All details about the English dependencies can be found in the manual:\r\n\r\n  Marie-Catherine de Marneffe and Christopher D. Manning. 2008. Stanford Dependencies manual.\r\n\r\nSee also: \r\n* http://nlp.stanford.edu/software/stanford-dependencies.shtml\r\n* http://nlp.stanford.edu/software/dependencies_manual.pdf",
  "language" : "en",
  "type" : null,
  "type_name" : null,
  "type_description" : null,
  "tags" : [ {
    "tag_name" : "acomp",
    "tag_description" : "adjectival complement\r\nAn adjectival complement of a verb is an adjectival phrase which functions as the complement (like an object of the verb).\r\n“She looks very beautiful” acomp(looks, beautiful)"
  }, {
    "tag_name" : "advcl",
    "tag_description" : "adverbial clause modifier\r\nAn adverbial clause modifier of a VP or S is a clause modifying the verb (temporal clause, consequence, conditional clause, purpose clause, etc.).\r\n“The accident happened as the night was falling” advcl(happened, falling)\r\n“If you know who did it, you should tell the teacher” advcl(tell, know)\r\n“He talked to him in order to secure the account” advcl(talked, secure)"
  }, {
    "tag_name" : "advmod",
    "tag_description" : "adverbial modifier\r\nAn adverbial modifier of a word is a (non-clausal) adverb or adverbial phrase (ADVP) that serves to modify the meaning of the word.\r\n“Genetically modified food” advmod(modified, genetically)\r\n“less often” advmod(often, less)"
  }, {
    "tag_name" : "agent",
    "tag_description" : "agent\r\nAn agent is the complement of a passive verb which is introduced by the preposition “by” and does the action. This relation only appears in the collapsed dependencies, where it can replace prep by, where appropriate. It does not appear in basic dependencies output.\r\n“The man has been killed by the police” agent(killed, police)\r\n“Effects caused by the protein are important” agent(caused, protein)"
  }, {
    "tag_name" : "amod",
    "tag_description" : "adjectival modifier\r\nAn adjectival modifier of an NP is any adjectival phrase that serves to modify the meaning of the NP.\r\n“Sam eats red meat” amod(meat, red)\r\n“Sam took out a 3 million dollar loan” amod(loan, dollar)\r\n“Sam took out a $ 3 million loan”amod(loan, $)"
  }, {
    "tag_name" : "appos",
    "tag_description" : "appositional modifier\r\nAn appositional modifier of an NP is an NP immediately to the right of the first NP that serves to define or modify that NP. It includes parenthesized examples, as well as defining abbreviations in one of these structures.\r\nSam , my brother , arrived\r\nBill ( John ’s cousin )\r\nThe Australian Broadcasting Corporation ( ABC )"
  }, {
    "tag_name" : "aux",
    "tag_description" : "auxiliary\r\nAn auxiliary of a clause is a non-main verb of the clause, e.g., a modal auxiliary, or a form of\r\n“be”, “do” or “have” in a periphrastic tense.\r\nReagan has died\r\nHe should leave"
  }, {
    "tag_name" : "auxpass",
    "tag_description" : "passive auxiliary\r\nA passive auxiliary of a clause is a non-main verb of the clause which contains the passive information.\r\n“Kennedy has been killed” auxpass(killed, been)\r\n“Kennedy was/got killed” auxpass(killed, was/got)"
  }, {
    "tag_name" : "cc",
    "tag_description" : "coordination\r\nA coordination is the relation between an element of a conjunct and the coordinating conjunction word of the conjunct. (Note: different dependency grammars have different treatments of coordination. We take one conjunct of a conjunction (normally the first) as the head of the conjunction.) A conjunction may also appear at the beginning of a sentence. This is also called\r\na cc, and dependent on the root predicate of the sentence.\r\n“Bill is big and honest” cc(big, and)\r\n“They either ski or snowboard” cc(ski, or)\r\n“And then we left.” cc(left, And)"
  }, {
    "tag_name" : "ccomp",
    "tag_description" : "clausal complement\r\nA clausal complement of a verb or adjective is a dependent clause with an internal subject which functions like an object of the verb, or adjective. Clausal complements for nouns are limited to complement clauses with a subset of nouns like “fact” or “report”. We analyze them the same (parallel to the analysis of this class as “content clauses” in Huddleston and Pullum\r\n2002). Such clausal complements are usually finite (though there are occasional remnant English subjunctives).\r\n“He says that you like to swim” ccomp(says, like)\r\n“I am certain that he did it” ccomp(certain, did)\r\n“I admire the fact that you are honest” ccomp(fact, honest)"
  }, {
    "tag_name" : "conj",
    "tag_description" : "conjunct\r\nA conjunct is the relation between two elements connected by a coordinating conjunction, such as “and”, “or”, etc. We treat conjunctions asymmetrically: The head of the relation is the first conjunct and other conjunctions depend on it via the conj relation.\r\n“Bill is big and honest” conj(big, honest)\r\n“They either ski or snowboard” conj(ski, snowboard)"
  }, {
    "tag_name" : "cop",
    "tag_description" : "copula\r\nA copula is the relation between the complement of a copular verb and the copular verb. (We normally take a copula as a dependent of its complement; see the discussion in section 4.)\r\n“Bill is big” cop(big, is)\r\n“Bill is an honest man” cop(man, is)"
  }, {
    "tag_name" : "csubj",
    "tag_description" : "clausal subject\r\nA clausal subject is a clausal syntactic subject of a clause, i.e., the subject is itself a clause. The governor of this relation might not always be a verb: when the verb is a copular verb, the root of the clause is the complement of the copular verb. In the two following examples, “what she said” is the subject.\r\n“What she said makes sense” csubj(makes, said)\r\n“What she said is not true” csubj(true, said)"
  }, {
    "tag_name" : "csubjpass",
    "tag_description" : "clausal passive subject\r\nA clausal passive subject is a clausal syntactic subject of a passive clause. In the example below, “that she lied” is the subject.\r\n“That she lied was suspected by everyone” csubjpass(suspected, lied)"
  }, {
    "tag_name" : "dep",
    "tag_description" : "dependent\r\nA dependency is labeled as dep when the system is unable to determine a more precise dependency relation between two words. This may be because of a weird grammatical construction, a limitation in the Stanford Dependency conversion software, a parser error, or because of an unresolved long distance dependency.\r\n“Then, as if to show that he could, . . . ” dep(show, if)"
  }, {
    "tag_name" : "det",
    "tag_description" : "determiner\r\nA determiner is the relation between the head of an NP and its determiner.\r\n“The man is here” det(man, the)\r\n“Which book do you prefer?” det(book, which)"
  }, {
    "tag_name" : "discourse",
    "tag_description" : "discourse element\r\nThis is used for interjections and other discourse particles and elements (which are not clearly linked to the structure of the sentence, except in an expressive way). We generally follow the guidelines of what the Penn Treebanks count as an INTJ. They define this to include:\r\ninterjections (oh, uh-huh, Welcome), fillers (um, ah), and discourse markers (well, like, actually, but not you know).\r\nIguazu is in Argentina :)"
  }, {
    "tag_name" : "dobj",
    "tag_description" : "expletive\r\nThis relation captures an existential “there”. The main verb of the clause is the governor.\r\n“There is a ghost in the room” expl(is, There)"
  }, {
    "tag_name" : "expl",
    "tag_description" : "expletive\r\nThis relation captures an existential “there”. The main verb of the clause is the governor.\r\n“There is a ghost in the room” expl(is, There)"
  }, {
    "tag_name" : "goeswith",
    "tag_description" : "goes with\r\nThis relation links two parts of a word that are separated in text that is not well edited. We follow the treebank: The GW part is the dependent and the head is in some sense the “main” part, often the second part.\r\nThey come here [with out] legal permission"
  }, {
    "tag_name" : "iobj",
    "tag_description" : "indirect object\r\nThe indirect object of a VP is the noun phrase which is the (dative) object of the verb.\r\n“She gave me a raise” iobj(gave, me)"
  }, {
    "tag_name" : "mark",
    "tag_description" : "marker\r\nA marker is the word introducing a finite clause subordinate to another clause. For a complement\r\nclause, this will typically be “that” or “whether”. For an adverbial clause, the marker is typically\r\na preposition like “while” or “although”. The mark is a dependent of the subordinate clause\r\nhead."
  }, {
    "tag_name" : "mwe",
    "tag_description" : "multi-word expression\r\nThe multi-word expression (modifier) relation is used for certain multi-word idioms that behave like a single function word. It is used for a closed set of dependencies between words in common multi-word expressions for which it seems difficult or unclear to assign any other relationships. At present, this relation is used inside the following expressions: rather than, as well as, instead of, such as, because of, instead of, in addition to, all but, such as, because of, instead of, due to. The boundaries of this class are unclear; it could grow or shrink a little over time.\r\n“I like dogs as well as cats” mwe(well, as)\r\n“He cried because of you” mwe(of, because)"
  }, {
    "tag_name" : "neg",
    "tag_description" : "negation modifier\r\nThe negation modifier is the relation between a negation word and the word it modifies.\r\n“Bill is not a scientist” neg(scientist, not)\r\n“Bill doesn’t drive” neg(drive, n’t)"
  }, {
    "tag_name" : "nn",
    "tag_description" : "noun compound modifier\r\nA noun compound modifier of an NP is any noun that serves to modify the head noun. (Note that in the current system for dependency extraction, all nouns modify the rightmost noun of the NP – there is no intelligent noun compound analysis. This is likely to be fixed once the Penn Treebank represents the branching structure of NPs.)\r\n“Oil price futures” nn(futures, oil) nn(futures, price)"
  }, {
    "tag_name" : "npadvmod",
    "tag_description" : "noun phrase as adverbial modifier\r\nThis relation captures various places where something syntactically a noun phrase (NP) is used as an adverbial modifier in a sentence. These usages include: (i) a measure phrase, which is the relation between the head of an ADJP/ADVP/PP and the head of a measure phrase modifying the ADJP/ADVP; (ii) noun phrases giving an extent inside a VP which are not objects; (iii) financial constructions involving an adverbial or PP-like NP, notably the following construction $5 a share, where the second NP means “per share”; (iv) floating reflexives; and (v) certain other absolutive NP constructions. A temporal modifier (tmod) is a subclass of\r\nnpadvmod which is distinguished as a separate relation.\r\n“The director is 65 years old” npadvmod(old, years)\r\n“6 feet long” npadvmod(long, feet)\r\n“Shares eased a fraction” npadvmod(eased, fraction)\r\n“IBM earned $ 5 a share” npadvmod($, share)\r\n“The silence is itself significant” npadvmod(significant, itself)\r\n“90% of Australians like him, the most of any country” npadvmod(like, most)"
  }, {
    "tag_name" : "nsubj",
    "tag_description" : "nominal subject\r\nA nominal subject is a noun phrase which is the syntactic subject of a clause. The governor of this relation might not always be a verb: when the verb is a copular verb, the root of the clause is the complement of the copular verb, which can be an adjective or noun.\r\n“Clinton defeated Dole” nsubj(defeated, Clinton)\r\n“The baby is cute” nsubj(cute, baby)"
  }, {
    "tag_name" : "nsubjpass",
    "tag_description" : "passive nominal subject\r\nA passive nominal subject is a noun phrase which is the syntactic subject of a passive clause.\r\n“Dole was defeated by Clinton” nsubjpass(defeated, Dole)"
  }, {
    "tag_name" : "num",
    "tag_description" : "numeric modifier\r\nA numeric modifier of a noun is any number phrase that serves to modify the meaning of the noun with a quantity.\r\n“Sam ate 3 sheep” num(sheep, 3)\r\n“Sam spent forty dollars” num(dollars, 40)\r\n“Sam spent $ 40” num($, 40)"
  }, {
    "tag_name" : "number",
    "tag_description" : "element of compound number\r\nAn element of compound number is a part of a number phrase or currency amount. We regard a number as a specialized kind of multi-word expression.\r\n“I have four thousand sheep” number (thousand, four)\r\n“I lost $ 3.2 billion” number (billion, 3.2)"
  }, {
    "tag_name" : "parataxis",
    "tag_description" : "parataxis\r\nThe parataxis relation (from Greek for “place side by side”) is a relation between the main verb of a clause and other sentential elements, such as a sentential parenthetical, a clause after a “:” or a “;”, or two sentences placed side by side without any explicit coordination or subordination.\r\n“The guy, John said, left early in the morning” parataxis(left, said)\r\n“Let’s face it we’re annoyed” parataxis(Let, annoyed)"
  }, {
    "tag_name" : "pcomp",
    "tag_description" : "prepositional complement\r\nThis is used when the complement of a preposition is a clause or prepositional phrase (or occasionally, an adverbial phrase). The prepositional complement of a preposition is the head of a clause following the preposition, or the preposition head of the following PP.\r\n“We have no information on whether users are at risk” pcomp(on, are)\r\n“They heard about you missing classes” pcomp(about, missing)"
  }, {
    "tag_name" : "pobj",
    "tag_description" : "object of a preposition\r\nThe object of a preposition is the head of a noun phrase following the preposition, or the adverbs “here” and “there”. (The preposition in turn may be modifying a noun, verb, etc.) Unlike the Penn Treebank, we here define cases of VBG quasi-prepositions like “including”, “concerning”, etc. as instances of pobj. (The preposition can be tagged a FW for “pace”, “versus”, etc. It can also be called a CC – but we don’t currently handle that and would need to distinguish from conjoined prepositions.) In the case of preposition stranding, the object can precede the preposition (e.g., “What does CPR stand for?”).\r\n“I sat on the chair” pobj(on, chair)"
  }, {
    "tag_name" : "poss",
    "tag_description" : "possession modifier\r\nThe possession modifier relation holds between the head of an NP and its possessive determiner, or a genitive ’s complement.\r\n“their offices” poss(offices, their)\r\n“Bill’s clothes” poss(clothes, Bill)"
  }, {
    "tag_name" : "possessive",
    "tag_description" : "possessive modifier\r\nThe possessive modifier relation appears between the head of an NP and the genitive ’s.\r\n8“Bill’s clothes” possessive(John, ’s)"
  }, {
    "tag_name" : "preconjunct",
    "tag_description" : "preconjunct\r\nA preconjunct is the relation between the head of an NP and a word that appears at the beginning bracketing a conjunction (and puts emphasis on it), such as “either”, “both”, “neither”).\r\n“Both the boys and the girls are here” preconj(boys, both)"
  }, {
    "tag_name" : "predet",
    "tag_description" : "predeterminer\r\nA predeterminer is the relation between the head of an NP and a word that precedes and modifies the meaning of the NP determiner.\r\n“All the boys are here” predet(boys, all)"
  }, {
    "tag_name" : "prep",
    "tag_description" : "prepositional modifier\r\nA prepositional modifier of a verb, adjective, or noun is any prepositional phrase that serves to modify the meaning of the verb, adjective, noun, or even another prepositon. In the collapsed representation, this is used only for prepositions with NP complements.\r\n“I saw a cat in a hat” prep(cat, in)\r\n“I saw a cat with a telescope” prep(saw, with)\r\n“He is responsible for meals” prep(responsible, for)"
  }, {
    "tag_name" : "prepc",
    "tag_description" : "prepositional clausal modifier\r\nIn the collapsed representation (see section 4), a prepositional clausal modifier of a verb, adjective, or noun is a clause introduced by a preposition which serves to modify the meaning of the verb, adjective, or noun.\r\n“He purchased it without paying a premium” prepc without(purchased, paying)"
  }, {
    "tag_name" : "prt",
    "tag_description" : "phrasal verb particle\r\nThe phrasal verb particle relation identifies a phrasal verb, and holds between the verb and its particle.\r\n“They shut down the station” prt(shut, down)"
  }, {
    "tag_name" : "punct",
    "tag_description" : "punctuation\r\nThis is used for any piece of punctuation in a clause, if punctuation is being retained in the typed dependencies. By default, punctuation is not retained in the output.\r\n“Go home!” punct(Go, !)"
  }, {
    "tag_name" : "quantmod",
    "tag_description" : "quantifier phrase modifier\r\nA quantifier modifier is an element modifying the head of a QP constituent. (These are modifiers in complex numeric quantifiers, not other types of “quantification”. Quantifiers like “all” become det.)\r\n“About 200 people came to the party” quantmod(200, About)"
  }, {
    "tag_name" : "ref",
    "tag_description" : "referent\r\nA referent of the head of an NP is the relative word introducing the relative clause modifying the NP.\r\n“I saw the book which you bought” ref (book, which)"
  }, {
    "tag_name" : "ROOT",
    "tag_description" : "root\r\nThe root grammatical relation points to the root of the sentence. A fake node “ROOT” is used as the governor. The ROOT node is indexed with “0”, since the indexation of real words in the sentence starts at 1.\r\n“I love French fries.” root(ROOT, love)\r\n“Bill is an honest man” root(ROOT, man)"
  }, {
    "tag_name" : "tmod",
    "tag_description" : "temporal modifier\r\nA temporal modifier (of a VP, NP, or an ADJP is a bare noun phrase constituent that serves to modify the meaning of the constituent by specifying a time. (Other temporal modifiers are prepositional phrases and are introduced as prep.)\r\n“Last night, I swam in the pool” tmod(swam, night)"
  }, {
    "tag_name" : "vmod",
    "tag_description" : "reduced non-finite verbal modifier\r\nA reduced non-finite verbal modifier is a participial or infinitive form of a verb heading a phrase (which may have some arguments, roughly like a VP). These are used to modify the meaning of an NP or another verb. They are not core arguments of a verb or full finite relative clauses.\r\n“Points to establish are . . . ” vmod(points, establish)\r\n“I don’t have anything to say to you” vmod(anything, say)\r\n“Truffles picked during the spring are tasty” vmod(truffles, picked)\r\n“Bill tried to shoot, demonstrating his incompetence” vmod(shoot, demonstrating)"
  }, {
    "tag_name" : "xcomp",
    "tag_description" : "open clausal complement\r\nAn open clausal complement (xcomp) of a VP or an ADJP is a clausal complement without its own subject, whose reference is determined by an external subject. These complements are always non-finite. The name xcomp is borrowed from Lexical-Functional Grammar.\r\n“He says that you like to swim” xcomp(like, swim)\r\n“I am ready to leave” xcomp(ready, leave)"
  }, {
    "tag_name" : "xsubj",
    "tag_description" : "controlling subject\r\nA controlling subject is the relation between the head of a open clausal complement (xcomp) and the external subject of that clause. This is an additional dependency, not a basic dependency.\r\n“Tom likes to eat fish” xsubj(eat, Tom)"
  } ],
  "create_tag" : false
}